
&НаКлиенте
Процедура Результат(Команда)
	Структура = Новый Структура;
	
	
	Если Реквизит1 = 0 Тогда
		InMe = InMe + 2;
	ИначеЕсли Реквизит1 = 1 Тогда
		Work = Work + 2;
	Иначе
		talk = talk + 2;
	КонецЕсли;
	Структура.Вставить("Вопрос1", Реквизит1);
	
	
	Если Реквизит2 = 0 Тогда
		Work = Work + 2;
	ИначеЕсли Реквизит2 = 1 Тогда
		InMe = InMe + 2;
	Иначе
		talk = talk + 2;
	КонецЕсли;
	Структура.Вставить("Вопрос2", Реквизит2);
	

	Если Реквизит3 = 0 Тогда
		InMe = InMe + 2;
	ИначеЕсли Реквизит3 = 1 Тогда
		Work = Work + 2;
	Иначе
		talk = talk + 2;
	КонецЕсли;
	Структура.Вставить("Вопрос3", Реквизит3);
	

	Если Реквизит4 = 0 Тогда
		Work = Work + 2;
	ИначеЕсли Реквизит4 = 1 Тогда
		talk = talk + 2;
	Иначе
		InMe = InMe + 2;
	КонецЕсли;
	Структура.Вставить("Вопрос4", Реквизит4);
	

	Если Реквизит5 = 0 Тогда
		talk = talk + 2;
	ИначеЕсли Реквизит5 = 1 Тогда
		InMe = InMe + 2;
	Иначе
		Work = Work + 2;
	КонецЕсли;
	Структура.Вставить("Вопрос5", Реквизит5);
	

	Если Реквизит6 = 0 Тогда
		talk = talk + 2;
	ИначеЕсли Реквизит6 = 1 Тогда
		Work = Work + 2;
	Иначе
		InMe = InMe + 2;
	КонецЕсли;
	Структура.Вставить("Вопрос6", Реквизит6);
	

	Если Реквизит7 = 0 Тогда
		Work = Work + 2;
	ИначеЕсли Реквизит7 = 1 Тогда
		talk = talk + 2;
	Иначе
		InMe = InMe + 2;
	КонецЕсли;
	Структура.Вставить("Вопрос7", Реквизит7);
	

	Если Реквизит8 = 0 Тогда
		InMe = InMe + 2;
	ИначеЕсли Реквизит8 = 1 Тогда
		talk = talk + 2;
	Иначе
		Work = Work + 2;
	КонецЕсли;
	Структура.Вставить("Вопрос8", Реквизит8);
	

	Если Реквизит9 = 0 Тогда
		talk = talk + 2;
	ИначеЕсли Реквизит9 = 1 Тогда
		Work = Work + 2;
	Иначе
		InMe = InMe + 2;
	КонецЕсли;
	Структура.Вставить("Вопрос9", Реквизит9);
	

	Если Реквизит10 = 0 Тогда
		InMe = InMe + 2;
	ИначеЕсли Реквизит10 = 1 Тогда
		Work = Work + 2;
	Иначе
		talk = talk + 2;
	КонецЕсли;
	Структура.Вставить("Вопрос10", Реквизит10);
	
	Если Реквизит11 = 0 Тогда
		
	ИначеЕсли Реквизит11 = 1 Тогда
		InMe = InMe + 2;
	Иначе
		Talk = Talk + 2;
	КонецЕсли;

	Если Реквизит12 = 0 Тогда
		
	ИначеЕсли Реквизит12 = 1 Тогда
		InMe = InMe + 2;
	Иначе
		Talk = Talk + 2;
	КонецЕсли;

	
	Если Реквизит13= 0 Тогда
		Talk = Talk + 2;
	ИначеЕсли Реквизит13 = 1 Тогда
		Work = Work + 2;
	Иначе
		InMe = InMe + 2;
	КонецЕсли;

	Если Реквизит14 = 0 Тогда
		InMe = InMe + 2;
	ИначеЕсли Реквизит14 = 1 Тогда
		Talk = Talk + 2;
	Иначе
		Work = Work + 2;
	КонецЕсли;

	Если Реквизит15 = 0 Тогда
		Work = Work + 2;
	ИначеЕсли Реквизит15 = 1 Тогда
		InMe = InMe + 2;
	Иначе
		Talk = Talk + 2;
	КонецЕсли;

	Если Реквизит16 = 0 Тогда
		InMe = InMe + 2;
	ИначеЕсли Реквизит16 = 1 Тогда
 		Work = Work + 2;
	Иначе
	    Talk = Talk + 2;
	КонецЕсли;

	Если Реквизит17 = 0 Тогда
		InMe = InMe + 2;
	ИначеЕсли Реквизит17 = 1 Тогда
		Work = Work + 2;
	Иначе
		Talk = Talk + 2;
	КонецЕсли;

	Если Реквизит18 = 0 Тогда
		InMe = InMe + 2;
	ИначеЕсли Реквизит18 = 1 Тогда
		Talk = Talk + 2;
	Иначе
		Work = Work + 2;
	КонецЕсли;

	Если Реквизит19 = 0 Тогда
		InMe = InMe + 2;
	ИначеЕсли Реквизит19 = 1 Тогда
		Talk = Talk + 2;
	Иначе
		Work = Work + 2;
	КонецЕсли;

	Если Реквизит20 = 0 Тогда
		Work = Work + 2;
	ИначеЕсли Реквизит20 = 1 Тогда
		Talk = Talk + 2;
	Иначе
		InMe = InMe + 2;
	КонецЕсли;

	Если Реквизит21 = 0 Тогда
		Talk = Talk + 2;
	ИначеЕсли Реквизит21 = 1 Тогда
		InMe = InMe + 2;
	Иначе
		Work = Work + 2;	
	КонецЕсли;


	Если Реквизит22 = 0 Тогда
		Talk = Talk + 2;
	ИначеЕсли Реквизит22 = 1 Тогда
		InMe = InMe + 2;
	Иначе
		Work = Work + 2;
	КонецЕсли;


	Если Реквизит23 = 0 Тогда
		Talk = Talk + 2;
	ИначеЕсли Реквизит23 = 1 Тогда
		Work = Work + 2;;
	Иначе
		InMe = InMe + 2;
	КонецЕсли;


	Если Реквизит24 = 0 Тогда
		Work = Work + 2;
	ИначеЕсли Реквизит24 = 1 Тогда
		InMe = InMe + 2;
	Иначе
		Talk = Talk + 2;
	КонецЕсли;


	Если Реквизит25 = 0 Тогда
		InMe = InMe + 2;
	ИначеЕсли Реквизит25 = 1 Тогда
		Work = Work + 2;
	Иначе
		Talk = Talk + 2;
	КонецЕсли;


	Если Реквизит26 = 0 Тогда
		Talk = Talk + 2;
	ИначеЕсли Реквизит26 = 1 Тогда
		Work = Work + 2;
	Иначе
		InMe = InMe + 2;
	КонецЕсли;


	Если Реквизит27 = 0 Тогда
		Talk = Talk + 2;
	ИначеЕсли Реквизит27 = 1 Тогда
		InMe = InMe + 2;
	Иначе
		Work = Work + 2;
	КонецЕсли;
	
	
	Сообщить("talk " + talk);
	Сообщить("Work " + Work);
	Сообщить("inMe " + InMe);
	
	//Сообщить("Выберите максимально не подходящий вам ответ");
	
	Элементы.Результат.Видимость = Ложь;
	//Элементы.ФормаПолучитьРезультат.Видимость = Истина;
	
	//ДобавлениеСтроки = ТаблицаЗнач.Добавить();
	//ДобавлениеСтроки.Вопрос = 1;
	//ДобавлениеСтроки.Ответ = Структура.Вопрос1;
	//
	//ДобавлениеСтроки = ТаблицаЗнач.Добавить();
	//ДобавлениеСтроки.Вопрос = 2;
	//ДобавлениеСтроки.Ответ = Структура.Вопрос2;
	//
	//ДобавлениеСтроки = ТаблицаЗнач.Добавить();
	//ДобавлениеСтроки.Вопрос = 3;
	//ДобавлениеСтроки.Ответ = Структура.Вопрос3;
	//
	//ДобавлениеСтроки = ТаблицаЗнач.Добавить();
	//ДобавлениеСтроки.Вопрос = 4;
	//ДобавлениеСтроки.Ответ = Структура.Вопрос4;
	//
	//ДобавлениеСтроки = ТаблицаЗнач.Добавить();
	//ДобавлениеСтроки.Вопрос = 5;
	//ДобавлениеСтроки.Ответ = Структура.Вопрос5;
	//
	//ДобавлениеСтроки = ТаблицаЗнач.Добавить();
	//ДобавлениеСтроки.Вопрос = 6;
	//ДобавлениеСтроки.Ответ = Структура.Вопрос6;
	//
	//ДобавлениеСтроки = ТаблицаЗнач.Добавить();
	//ДобавлениеСтроки.Вопрос = 7;
	//ДобавлениеСтроки.Ответ = Структура.Вопрос7;
	//
	//ДобавлениеСтроки = ТаблицаЗнач.Добавить();
	//ДобавлениеСтроки.Вопрос = 8;
	//ДобавлениеСтроки.Ответ = Структура.Вопрос8;
	//
	//ДобавлениеСтроки = ТаблицаЗнач.Добавить();
	//ДобавлениеСтроки.Вопрос = 9;
	//ДобавлениеСтроки.Ответ = Структура.Вопрос9;
	//
	//ДобавлениеСтроки = ТаблицаЗнач.Добавить();
	//ДобавлениеСтроки.Вопрос = 10;
	//ДобавлениеСтроки.Ответ = Структура.Вопрос10;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРезультат(Команда)
	НеПодхРез = ЗаписьСтруктурыНеПодхРезультатов();
КонецПроцедуры

Функция ЗаписьСтруктурыНеПодхРезультатов()
	СтруктураНеПодхОтветов = Новый Структура;
	СтруктураНеПодхОтветов.Вставить("Вопрос1", Реквизит1);
	СтруктураНеПодхОтветов.Вставить("Вопрос2", Реквизит2);
	СтруктураНеПодхОтветов.Вставить("Вопрос3", Реквизит3);
	СтруктураНеПодхОтветов.Вставить("Вопрос4", Реквизит4);
	СтруктураНеПодхОтветов.Вставить("Вопрос5", Реквизит5);
	СтруктураНеПодхОтветов.Вставить("Вопрос6", Реквизит6);
	СтруктураНеПодхОтветов.Вставить("Вопрос7", Реквизит7);
	СтруктураНеПодхОтветов.Вставить("Вопрос8", Реквизит8);
	СтруктураНеПодхОтветов.Вставить("Вопрос9", Реквизит9);
	СтруктураНеПодхОтветов.Вставить("Вопрос10", Реквизит10);
	Возврат СтруктураНеПодхОтветов;
КонецФункции